Project/Toir/src/Catalogs/СерверыОчередейRMQ/СерверыОчередейRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерверыОчередейRMQ</name>
  <predefined>
    <items>
      <name>Основной</name>
    </items>
  </predefined>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВиртуальныйХост</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Порт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезопасноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуСертификатаУдостоверяющегоЦентра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуЗакрытогоКлюча</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуСертификатаКлиента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаСоответствияИмениСервера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодключенияИзолированно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/СерверыОчередейRMQ/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПроверитьСоединениеНаСервере()
	Клиент = ОчередьСообщений.СоздатьЭкземплярКомпоненты(); 
	Если Объект.БезопасноеСоединение Тогда
		Клиент.УстановитьБезопасноеСоединение(
		    Объект.ПутьКФайлуСертификатаУдостоверяющегоЦентра,
		    Объект.ПутьКФайлуЗакрытогоКлюча,
		    Объект.ПутьКФайлуСертификатаКлиента,
		    Объект.АдресСервера,
		    Объект.Логин,
		    Объект.Пароль,
		    Объект.Порт,
		    Объект.ВиртуальныйХост,
		    ,
		    Объект.ПроверкаСоответствияИмениСервера)
	Иначе
		Клиент.УстановитьСоединение(
			Объект.АдресСервера,
			Объект.Логин,
			Объект.Пароль,
			Объект.Порт,
			Объект.ВиртуальныйХост); 
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоединение(Команда)
	Попытка
		ПроверитьСоединениеНаСервере();
		ПоказатьОповещениеПользователя(НСтр("ru = 'Соединение успешно установлено'"));
	Исключение
		Сообщить(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры
